porousCondensateFoam/tutorials/darcyFoamD-tutorials/darcy0/constant/wellboreProperties
/*--------------------------------*- C++ -*----------------------------------*\
  | =========                 |                                                 |
  | \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
  |  \\    /   O peration     | Version:  5.0                                   |
  |   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
  |    \\/     M anipulation  |                                                 |
  \*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "constant";
  object      wellboreProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//////production1

well.Pro1
   {
     
	   activate	                                                   1; 
           q	            q                [0 3 -1 0 0 0 0]	        1e-3;
           volume           volume           [0 3 0 0 0 0 0]	         100;
           timechangeplan   timechangeplan   [0 0 1 0 0 0 0]	         100;
           radius           radius           [0 1 0 0 0 0 0]	           1;
           height           height           [0 1 0 0 0 0 0]	         100;
           pb               pb               [1 -1 -2 0 0 0 0]	         100;

     
   } 
/////////////// 

//////injection1

well.Inj1
   {
     
	   activate	                                                   1; 
           q	         q                   [0 3 -1 0 0 0 0]	        1e-3;
           volume           volume           [0 3 0 0 0 0 0]	         100;
           timechangeplan   timechangeplan   [0 0 1 0 0 0 0]	         100;
           radius           radius           [0 1 0 0 0 0 0]	           1;
           height           height           [0 1 0 0 0 0 0]	         100;
           pb               pb               [1 -1 -2 0 0 0 0]	 100;
 
     	
   } 
///////////////  


// ************************************************************************* //
