porousCondensateFoam/tutorials/darcyFoamD-tutorials/darcy0/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/layer1";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    x0
    {
        type            zeroGradient;
    }
    y0
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    y1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    z0
    {
        type            empty;
    }
    layer1_to_layer2
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    layer1_to_layer1Pro
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    layer1_to_layer2Inj
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
