porousCondensateFoam/tutorials/darcyFoamD-tutorials/darcy0/0/K.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "0";
    object      K;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions     [0  2  0 0 0 0 0];

internalField   uniform (1e-11 0 0 0 1e-09 0 0 0 1e-10);

boundaryField
{
    top
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    axis
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
