porousCondensateFoam/tutorials/darcyFoamD-tutorials/darcy0/0/WPro1.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      WPro1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
  inlet
    {
      type            zeroGradient;
    }
  top
    {
      type            zeroGradient;
    }
  axis
    {
      type            zeroGradient;
    }
  frontAndBack
    {
      type            empty;
    }
}


// ************************************************************************* //
