porousCondensateFoam/tutorials/darcyFoamD-tutorials/darcy0/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Steady;
}

gradSchemes
{
    default none;
    grad(p) Gauss linear;
}

divSchemes
{
    default none;
}

laplacianSchemes
{
    default none;
    laplacian(-Mf,p) Gauss linear corrected;
}

interpolationSchemes
{
    default none;
    K       harmonic;
    //flux(U) linear;
}

snGradSchemes
{
    default corrected;
}

//fluxRequired
//{
   // default no;
   // p;
//}

// ************************************************************************* //
