porousCondensateFoam/tutorials/darcyFoamD-tutorials/darcy0/system/setFieldsDict

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
	volTensorFieldValue K    (1e-11 0 0 0 1e-09 0 0 0 1e-10)
	volScalarFieldValue WInj1 0
	volScalarFieldValue WPro1 0
);



regions
(
    // injection
   boxToCell
   {
     box (4.9 8 0) (5.1 8.2 1);
     fieldValues
	(
	   volScalarFieldValue WInj1 1 
     	);
   }   

   // production
    boxToCell
   {
     box (4.9 0.8 0) (5.1 1 1);
     fieldValues
        (
           volScalarFieldValue WPro1 1 
        );
   }   
     
   // layer2
    boxToCell
   {
     box (4.9 0.8 0) (5.1 1 1);
     fieldValues
        (
           volTensorFieldValue K    (1e-11 0 0 0 1e-09 0 0 0 1e-10) 
        );
   }     
     
// layer3
    boxToCell
   {
     box (4.9 0.8 0) (5.1 1 1);
     fieldValues
        (
           volTensorFieldValue K   (1e-11 0 0 0 1e-09 0 0 0 1e-10)
        );
   }      

);



